const ksList = {
	"400101": true, // 和值 3
	"400102": true, // 和值 4
	"400103": true, // 和值 5
	"400104": true, // 和值 6
	"400105": true, // 和值 7
	"400106": true, // 和值 8
	"400107": true, // 和值 9
	"400108": true, // 和值 10
	"400109": true, // 和值 11
	"400110": true, // 和值 12
	"400111": true, // 和值 13
	"400112": true, // 和值 14
	"400113": true, // 和值 15
	"400114": true, // 和值 16
	"400115": true, // 和值 17
	"400116": true, // 和值 18
	"400117": true, // 和值 大
	"400118": true, // 和值 小
	"400119": true, // 和值 单
	"400120": true, // 和值 双
	"400121": true, // 和值 大单
	"400122": true, // 和值 小单
	"400123": true, // 和值 大双
	"400124": true, // 和值 小双
	"400201": true, // 三同号 通选
	"400301": true, // 三同号 单选
	"400401": true, // 三不同号 标准
	"400402": true, // 三不同号 胆拖
	"400501": true, // 三连号 通选
	"400601": true, // 二同号 复选
	"400701": true, // 二同号 单选
	"400801": true, // 二不同号 标准
	"400802": true, // 二不同号 胆拖
	"400901": true, // 三连号 单选
	"401001": true, // 号码 必出
	"401002": true, // 号码 不出
	"401101": true, // 1~3号球 第一球
	"401102": true, // 1~3号球 第二球
	"401103": true, // 1~3号球 第三球
}

export default ksList