/**
 * danshi 单式 
 * normal 一般
 * special 特殊
 */
const BJSCBetNumbersConfig = {
    danshi: {
        "600203": true, // 前二直选 单式
        "600302": true, // 前三直选 单式
    },
    normal: {
        "600101": true, // 前一直选 复式
        "600202": true, // 前二直选 复式
        "600301": true, // 前三直选 复式
        "600401": true, // 定位胆 定位胆
        "600502": true, // 龙虎
        "600501": true, // 大小单双
    },
    special: {
        "600503": true, // 冠亚合值 大
        "600504": true, // 冠亚合值 小
        "600505": true, // 冠亚合值 单
        "600506": true, // 冠亚合值 双
        "600507": true, // 冠亚组合合值 3
        "600508": true, // 冠亚组合合值 4
        "600509": true, // 冠亚组合合值 5
        "600510": true, // 冠亚组合合值 6
        "600511": true, // 冠亚组合合值 7
        "600512": true, // 冠亚组合合值 8
        "600513": true, // 冠亚组合合值 9
        "600514": true, // 冠亚组合合值 10
        "600515": true, // 冠亚组合合值 11
        "600516": true, // 冠亚组合合值 12
        "600517": true, // 冠亚组合合值 13
        "600518": true, // 冠亚组合合值 14
        "600519": true, // 冠亚组合合值 15
        "600520": true, // 冠亚组合合值 16
        "600521": true, // 冠亚组合合值 17
        "600522": true, // 冠亚组合合值 18
        "600523": true, // 冠亚组合合值 19
    }
}

export default BJSCBetNumbersConfig