/**
 * danshi 单式 
 * fushi 复式
 * other 其他按钮形式的，但左侧不是万千百这些的
 */
const fiveFromElevenBetNumbersConfig = {
    fushi: {
        "500101": true, // 前三直选 复式
        "500106": true, // 中三直选 复式
        "500111": true, // 后三直选 复式
        "500201": true, // 前二直选 复式
        "500206": true, // 后二直选 复式
        "500401": true, // 定位胆 定位胆
    },
    other: {
        "500103": true, // 前三组选 复式
        "500105": true, // 前三组选 胆拖
        "500108": true, // 中三组选 复式
        "500110": true, // 中三组选 胆拖
        "500113": true, // 后三组选 复式
        "500115": true, // 后三组选 胆拖
        "500203": true, // 前二组选 复式
        "500205": true, // 前二组选 胆拖
        "500208": true, // 后二组选 复式
        "500210": true, // 后二组选 胆拖
        "500301": true, // 不定位 前三
        "500302": true, // 不定位 中三
        "500303": true, // 不定位 后三
        "500501": true, // 任选复式 任选一中一
        "500502": true, // 任选复式 任选二中二
        "500503": true, // 任选复式 任选三中三
        "500504": true, // 任选复式 任选四中四
        "500505": true, // 任选复式 任选五中五
        "500506": true, // 任选复式 任选六中五
        "500507": true, // 任选复式 任选七中五
        "500508": true, // 任选复式 任选八中五
        "500701": true, // 任选胆拖 任选二中二
        "500702": true, // 任选胆拖 任选三中三
        "500703": true, // 任选胆拖 任选四中四
        "500704": true, // 任选胆拖 任选五中五
        "500705": true, // 任选胆拖 任选六中五
        "500706": true, // 任选胆拖 任选七中五
        "500707": true, // 任选胆拖 任选八中五
    },
    danshi: {
        "500102": true, // 前三直选 单式
        "500104": true, // 前三组选 单式
        "500107": true, // 中三直选 单式
        "500109": true, // 中三组选 单式
        "500112": true, // 后三直选 单式
        "500114": true, // 后三组选 单式
        "500202": true, // 前二直选 单式
        "500204": true, // 前二组选 单式
        "500207": true, // 后二直选 单式
        "500209": true, // 后二组选 单式
        "500601": true, // 任选单式 任选一中一
        "500602": true, // 任选单式 任选二中二
        "500603": true, // 任选单式 任选三中三
        "500604": true, // 任选单式 任选四中四
        "500605": true, // 任选单式 任选五中五
        "500606": true, // 任选单式 任选六中五
        "500607": true, // 任选单式 任选七中五
        "500608": true, // 任选单式 任选八中五
    }
}

export default fiveFromElevenBetNumbersConfig