const justifyStartConfig = {
    "100303": true, // 三星直选 和值
    "300203": true, // 前二直选 和值
    "300207": true, // 后二直选 和值
    "300211": true, // 前二组选 和值
    "300215": true, // 后二组选 和值
    "300303": true, // 前三直选 和值
    "200101": true, // 特码
    "200201": true, // 特两面
    "200501": true, // 正码 正码
    "200601": true, // 正码特 正码特一
    "200602": true, // 正码特 正码特二
    "200603": true, // 正码特 正码特三
    "200604": true, // 正码特 正码特四
    "200605": true, // 正码特 正码特五
    "200606": true, // 正码特 正码特六
    "200301": true, // 红波
    "200302": true, // 蓝波
    "200303": true, // 绿波
    "300309": true, // 前三组选 组选和值
    "100403": true, // 三星组选 和值
    "300312": true, // 前三其他 特殊号码
    "300403": true, // 中三直选 和值
    "300409": true, // 中三组选 组选和值
    "300412": true, // 中三其他 特殊号码
    "300503": true, // 后三直选 和值
    "300509": true, // 后三组选 组选和值
    "300512": true, // 后三其他 特殊号码
    "300801": true, // 后二 大小单双
    "300802": true, // 后三 大小单双
    "300803": true, // 前二 大小单双
    "300804": true, // 前三 大小单双
    "100501": true, // 大小单双 前二
    "100502": true, // 大小单双 后二
    "301003": true, // 任二直选 和值
    "301006": true, // 任二组选 和值
    "301103": true, // 任三直选 和值
    "301109": true, // 任三组选 组选和值
    "400201": true, // 三同号 通选
    "400301": true, // 三同号 单选
    "400401": true, // 三不同号 标准
    "400402": true, // 三不同号 胆拖
    "400501": true, // 三连号 通选
    "400601": true, // 二同号 复选
    "400701": true, // 二同号 单选
    "400801": true, // 二不同号 标准
    "400802": true, // 二不同号 胆拖
    "400101": true, // 和值 3
    "400102": true, // 和值 4
    "400103": true, // 和值 5
    "400104": true, // 和值 6
    "400105": true, // 和值 7
    "400106": true, // 和值 8
    "400107": true, // 和值 9
    "400108": true, // 和值 10
    "400109": true, // 和值 11
    "400110": true, // 和值 12
    "400111": true, // 和值 13
    "400112": true, // 和值 14
    "400113": true, // 和值 15
    "400114": true, // 和值 16
    "400115": true, // 和值 17
    "400116": true, // 和值 18
    "600502": true, // 龙虎
}

export default justifyStartConfig