/**
 * tema 特码 
 * teliangmian 特两面
 * sebo 色波
 * banbo 色波
 * texiao 特肖
 */
const LHCBetNumbersConfig = {
    tema: {
        "200101": true, // 特码
        "200501": true, // 正码 正码
        "200601": true, // 正码特 正码特一
        "200602": true, // 正码特 正码特二
        "200603": true, // 正码特 正码特三
        "200604": true, // 正码特 正码特四
        "200605": true, // 正码特 正码特五
        "200606": true, // 正码特 正码特六
    },
    banbo:{
    	"200801": true, // 半波 红波红大
        "200802": true, // 半波 红波红小
        "200803": true, // 半波 红波红单
        "200804": true, // 半波 红波红双
        "200805": true, // 半波 红波蓝大
        "200806": true, // 半波 红波蓝小
        "200807": true, // 半波 红波蓝单
        "200808": true, // 半波 红波蓝双
        "200809": true, // 半波 红波绿大
        "200810": true, // 半波 红波绿小
        "200811": true, // 半波 红波绿单
        "200812": true, // 半波 红波绿双
    },
    teliangmian: {
        "200201": true, // 特两面
        "200502": true, // 正码 总和
    },
    zmlm:{
    	"200701": true, // 正码1~6 正码1两面
        "200702": true, // 正码1~6 正码1红
        "200703": true, // 正码1~6 正码1蓝
        "200704": true, // 正码1~6 正码1绿
        "200705": true, // 正码1~6 正码2两面
        "200706": true, // 正码1~6 正码2红
        "200707": true, // 正码1~6 正码2蓝
        "200708": true, // 正码1~6 正码2绿
        "200709": true, // 正码1~6 正码3两面
        "200710": true, // 正码1~6 正码3红
        "200711": true, // 正码1~6 正码3蓝
        "200712": true, // 正码1~6 正码2绿
        "200713": true, // 正码1~6 正码4两面
        "200714": true, // 正码1~6 正码4红
        "200715": true, // 正码1~6 正码4蓝
        "200716": true, // 正码1~6 正码4绿
        "200717": true, // 正码1~6 正码5两面
        "200718": true, // 正码1~6 正码5红
        "200719": true, // 正码1~6 正码5蓝
        "200720": true, // 正码1~6 正码5绿
        "200721": true, // 正码1~6 正码6两面
        "200722": true, // 正码1~6 正码6红
        "200723": true, // 正码1~6 正码6蓝
        "200724": true, // 正码1~6 正码6绿
    },
    sebo: {
        "200301": true, // 色波红
        "200302": true, // 色波蓝
        "200303": true, // 色波绿
    },
    texiao: {
        "200401": true, // 特肖
        "200901": true, // 一肖 一肖
        "201001": true, // 合肖(中) 一肖
        "201002": true, // 合肖(中) 二肖
        "201003": true, // 合肖(中) 三肖
        "201004": true, // 合肖(中) 四肖
        "201005": true, // 合肖(中) 五肖
        "201006": true, // 合肖(中) 六肖
        "201007": true, // 合肖(中) 七肖
        "201008": true, // 合肖(中) 八肖
        "201009": true, // 合肖(中) 九肖
        "201010": true, // 合肖(中) 十肖
        "201011": true // 合肖(中) 十一肖
    }
}

export default LHCBetNumbersConfig