/**
 * baodan  一种注数
 * combineTimes  组合后相乘
 * dantuo  胆拖
 * hexiao  合肖
 * noOneEqual  11选5的直选
 * fixedBet  每个号有对应的注数
 * moreCombine  超过3个的组合
 * numberTimes  每一行选中的数量相乘
 * oneCombine  1个的组合
 * threeCombine  3个的组合
 * twoArrange  2个的排列
 * twoCombine  2个的组合
 */


const calcBetCountConfig = {
    numberTimes: {
        "100201": true, // 前二直选
        "100202": true, // 后二直选
        "300201": true, // 前二直选 复式
        "300205": true, // 后二直选 复式
        "300301": true, // 前三直选 复式
        "100301": true, // 三星直选 复试
        "300305": true, // 前三直选 组合
        "300401": true, // 中三直选 复式
        "300405": true, // 中三直选 组合
        "300501": true, // 后三直选 复式
        "300505": true, // 后三直选 组合
        "300601": true, // 后四直选 复式
        "300701": true, // 五星直选 复式
        "300801": true, // 后二 大小单双
        "300802": true, // 后三 大小单双
        "300803": true, // 前二 大小单双
        "300804": true, // 前三 大小单双
        "100501": true, // 大小单双 前二
        "100502": true, // 大小单双 后二
    },
    fixedBet: {
        "300203": true, // 前二直选 和值
        "300204": true, // 前二直选 跨度
        "300207": true, // 后二直选 和值
        "100303": true, // 三星直选 和值
        "300208": true, // 后二直选 跨度
        "300211": true, // 前二组选 和值
        "300215": true, // 后二组选 和值
        "100403": true, // 三星组选 和值
        "300303": true, // 前三直选 和值
        "300304": true, // 前三直选 跨度
        "300309": true, // 前三组选 组选和值
        "300403": true, // 中三直选 和值
        "300404": true, // 中三直选 跨度
        "300409": true, // 中三组选 组选和值
        "300503": true, // 后三直选 和值
        "300504": true, // 后三直选 跨度
        "300509": true, // 后三组选 组选和值
        "301003": true, // 任二直选 和值
        "301006": true, // 任二组选 和值
        "301103": true, // 任三直选 和值
        "301109": true, // 任三组选 组选和值
    },
    baodan: {
        "300212": true, // 前二组选 包胆
        "300216": true, // 后二组选 包胆
        "300310": true, // 前三组选 组选包胆
        "300410": true, // 中三组选 组选包胆
        "300510": true, // 后三组选 组选包胆
    },
    oneCombine: {
        "100101": true, // 定位胆
        "200101": true, // 特码
        "200501": true, // 正码 正码
        "200601": true, // 正码特 正码特一
        "200602": true, // 正码特 正码特二
        "200603": true, // 正码特 正码特三
        "200604": true, // 正码特 正码特四
        "200605": true, // 正码特 正码特五
        "200606": true, // 正码特 正码特六

        "200801": true, // 半波 红波红大
        "200802": true, // 半波 红波红小
        "200803": true, // 半波 红波红单
        "200804": true, // 半波 红波红双
        "200805": true, // 半波 红波蓝大
        "200806": true, // 半波 红波蓝小
        "200807": true, // 半波 红波蓝单
        "200808": true, // 半波 红波蓝双
        "200809": true, // 半波 红波绿大
        "200810": true, // 半波 红波绿小
        "200811": true, // 半波 红波绿单
        "200812": true, // 半波 红波绿双

        "200201": true, // 特两面
        "200502": true, // 正码 总和

        "200701": true, // 正码1~6 正码1两面
        "200702": true, // 正码1~6 正码1红
        "200703": true, // 正码1~6 正码1蓝
        "200704": true, // 正码1~6 正码1绿
        "200705": true, // 正码1~6 正码2两面
        "200706": true, // 正码1~6 正码2红
        "200707": true, // 正码1~6 正码2蓝
        "200708": true, // 正码1~6 正码2绿
        "200709": true, // 正码1~6 正码3两面
        "200710": true, // 正码1~6 正码3红
        "200711": true, // 正码1~6 正码3蓝
        "200712": true, // 正码1~6 正码2绿
        "200713": true, // 正码1~6 正码4两面
        "200714": true, // 正码1~6 正码4红
        "200715": true, // 正码1~6 正码4蓝
        "200716": true, // 正码1~6 正码4绿
        "200717": true, // 正码1~6 正码5两面
        "200718": true, // 正码1~6 正码5红
        "200719": true, // 正码1~6 正码5蓝
        "200720": true, // 正码1~6 正码5绿
        "200721": true, // 正码1~6 正码6两面
        "200722": true, // 正码1~6 正码6红
        "200723": true, // 正码1~6 正码6蓝
        "200724": true, // 正码1~6 正码6绿
        "200301": true, // 色波红
        "200302": true, // 色波蓝
        "200303": true, // 色波绿
        "200401": true, // 特肖
        "200901": true, // 一肖 一肖
        "300101": true, // 定位胆
        "300311": true, // 前三其他 和值尾数
        "300312": true, // 前三其他 特殊号码
        "300411": true, // 中三其他 和值尾数
        "300412": true, // 中三其他 特殊号码
        "300511": true, // 后三其他 和值尾数
        "300512": true, // 后三其他 特殊号码
        "300901": true, // 前三 一码不定位
        "300903": true, // 后三 一码不定位
        "300905": true, // 前四 一码不定位
        "300907": true, // 后四 一码不定位
        "300909": true, // 五星 一码不定位
        "100601": true, // 一码不定位
        "301401": true, // 整合 万定位
        "301402": true, // 整合 千定位
        "301403": true, // 整合 佰定位
        "301404": true, // 整合 拾定位
        "301405": true, // 整合 个定位
        "301406": true, // 整合 总和
        "301407": true, // 龙虎 万千
        "301408": true, // 龙虎 万佰
        "301409": true, // 龙虎 万拾
        "301410": true, // 龙虎 万个
        "301411": true, // 龙虎 千佰
        "301412": true, // 龙虎 千拾
        "301413": true, // 龙虎 千个
        "301414": true, // 龙虎 佰拾
        "301415": true, // 龙虎 佰个
        "301416": true, // 龙虎 拾个
        "301417": true, // 龙虎 和
        "301418": true, // 和值单双 万千
        "301419": true, // 和值单双 万佰
        "301420": true, // 和值单双 万拾
        "301421": true, // 和值单双 万个
        "301422": true, // 和值单双 千佰
        "301423": true, // 和值单双 千拾
        "301424": true, // 和值单双 千个
        "301425": true, // 和值单双 佰拾
        "301426": true, // 和值单双 佰个
        "301427": true, // 和值单双 拾个
        "500401": true, // 定位胆 定位胆
        "500301": true, // 不定位 前三
        "500302": true, // 不定位 中三
        "500303": true, // 不定位 后三
        "500501": true, // 任选复式 任选一中一
        "400101": true, // 和值 3
        "400102": true, // 和值 4
        "400103": true, // 和值 5
        "400104": true, // 和值 6
        "400105": true, // 和值 7
        "400106": true, // 和值 8
        "400107": true, // 和值 9
        "400108": true, // 和值 10
        "400109": true, // 和值 11
        "400110": true, // 和值 12
        "400111": true, // 和值 13
        "400112": true, // 和值 14
        "400113": true, // 和值 15
        "400114": true, // 和值 16
        "400115": true, // 和值 17
        "400116": true, // 和值 18
        "400201": true, // 三同号 通选
        "400301": true, // 三同号 单选
        "400501": true, // 三连号 通选
        "400601": true, // 二同号 复选
        "400901": true, // 三连号 单选
        "401001": true, // 号码 必出
        "401002": true, // 号码 不出
        "401101": true, // 1~3号球 第一球
        "401102": true, // 1~3号球 第二球
        "401103": true, // 1~3号球 第三球
        "600101": true, // 前一直选 复式
        "600401": true, // 定位胆 定位胆
        "600501": true, // 大小单双
        "600502": true, // 龙虎
        "600503": true, // 冠亚合值 大
        "600504": true, // 冠亚合值 小
        "600505": true, // 冠亚合值 单
        "600506": true, // 冠亚合值 双
        "600507": true, // 冠亚组合合值 3
        "600508": true, // 冠亚组合合值 4
        "600509": true, // 冠亚组合合值 5
        "600510": true, // 冠亚组合合值 6
        "600511": true, // 冠亚组合合值 7
        "600512": true, // 冠亚组合合值 8
        "600513": true, // 冠亚组合合值 9
        "600514": true, // 冠亚组合合值 10
        "600515": true, // 冠亚组合合值 11
        "600516": true, // 冠亚组合合值 12
        "600517": true, // 冠亚组合合值 13
        "600518": true, // 冠亚组合合值 14
        "600519": true, // 冠亚组合合值 15
        "600520": true, // 冠亚组合合值 16
        "600521": true, // 冠亚组合合值 17
        "600522": true, // 冠亚组合合值 18
        "600523": true, // 冠亚组合合值 19
    },
    twoCombine: {
        "300209": true, // 前二组选 复式
        "100203": true, // 前二组选
        "100204": true, // 后二组选
        "300213": true, // 后二组选 复式
        "300902": true, // 前三 二码不定位
        "300904": true, // 后三 二码不定位
        "300906": true, // 前四 二码不定位
        "300908": true, // 后四 二码不定位
        "300910": true, // 五星 二码不定位
        "100602": true, // 二码不定位
        "301004": true, // 任二组选 复式
        "301205": true, // 任四组选 组选6
        "500203": true, // 前二组选 复式
        "500208": true, // 后二组选 复式
        "500502": true, // 任选复式 任选二中二
        "400801": true, // 二不同号 标准
    },
    threeCombine: {
        "300911": true, // 五星 三码不定位
        "300307": true, // 前三组选 组六
        "300407": true, // 中三组选 组六
        "300507": true, // 后三组选 组六
        "301106": true, // 任三组选 组六复式
        "100402": true, // 三星组选 组六
        "500103": true, // 前三组选 复式
        "500108": true, // 中三组选 复式
        "500113": true, // 后三组选 复式
        "500503": true, // 任选复式 任选三中三
        "400401": true, // 三不同号 标准
    },
    moreCombine: {
        "500504": true, // 任选复式 任选四中四
        "500505": true, // 任选复式 任选五中五
        "500506": true, // 任选复式 任选六中五
        "500507": true, // 任选复式 任选七中五
        "500508": true, // 任选复式 任选八中五
    },
    combineTimes: {
        "301001": true, // 任二直选 复式
        "301101": true, // 任三直选 复式
        "301201": true, // 任四直选 复式
    },
    twoArrange: {
        "100401": true, // 三星组选 组三
        "300306": true, // 前三组选 组三
        "300406": true, // 中三组选 组三
        "300506": true, // 后三组选 组三
        "301104": true, // 任三组选 组三复式
    },
    noOneEqual: {
        "500101": true, // 前三直选 复式
        "500106": true, // 中三直选 复式
        "500111": true, // 后三直选 复式
        "500201": true, // 前二直选 复式
        "500206": true, // 后二直选 复式
        "301206": true, // 任四组选 组选4
        "600202": true, // 前二直选 复式
        "600301": true, // 前三直选 复式
    },
    dantuo: {
        "500105": true, // 前三组选 胆拖
        "500110": true, // 中三组选 胆拖
        "500115": true, // 后三组选 胆拖
        "500205": true, // 前二组选 胆拖
        "500210": true, // 后二组选 胆拖
        "500701": true, // 任选胆拖 任选二中二
        "500702": true, // 任选胆拖 任选三中三
        "500703": true, // 任选胆拖 任选四中四
        "500704": true, // 任选胆拖 任选五中五
        "500705": true, // 任选胆拖 任选六中五
        "500706": true, // 任选胆拖 任选七中五
        "500707": true, // 任选胆拖 任选八中五
        "400402": true, // 三不同号 胆拖
        "400802": true, // 二不同号 胆拖
        "400701": true, // 二同号 单选
    },
    hexiao: {
        "201001": true, // 合肖(中) 一肖
        "201002": true, // 合肖(中) 二肖
        "201003": true, // 合肖(中) 三肖
        "201004": true, // 合肖(中) 四肖
        "201005": true, // 合肖(中) 五肖
        "201006": true, // 合肖(中) 六肖
        "201007": true, // 合肖(中) 七肖
        "201008": true, // 合肖(中) 八肖
        "201009": true, // 合肖(中) 九肖
        "201010": true, // 合肖(中) 十肖
        "201011": true,// 合肖(中) 十一肖
    }
    /**
     * 这几种最特殊，单独
     * "301203": true, // 任四组选 组选24
     * "301204": true, // 任四组选 组选12
     */
}

export default calcBetCountConfig