<template>
	<div class="lm-help">
        <yd-navbar :title="gameType.kindName+'-规则'">
			<div slot="left" @click="$parent.showLmpHelp = false">
				<yd-navbar-back-icon ></yd-navbar-back-icon>
			</div>
		</yd-navbar>
		<div class="typo" v-if="gameType.classId==6">
			<ul>
				<li><span>具体游戏规则如下</span><span lang="EN-US">:
       </span></li>
				<li><b><span>1～10 两面：</span></b><span>指 单、双；大、小。 <span lang="EN-US">
        </span></span>
				</li>
			</ul>
			<ul>
				<li><span lang="EN-US">&nbsp;</span><span>单、双：号码为双数叫双，如</span><span lang="EN-US">4</span><span>、</span><span lang="EN-US">8</span><span>；号码为单数叫单， 如</span><span lang="EN-US">5</span><span>、</span>9<span lang="EN-US"></span><span>。 <span lang="EN-US">
        </span> </span>
				</li>
				<li><span lang="" en-us="">&nbsp;</span><span>大、小：开出之号码大于或等于</span><span lang="EN-US">6</span><span>为大，小于或等于</span>5<span>为小。 <span lang="" en-us="">
        </span></span>
				</li>
				<li><span lang="EN-US"><strong>第一名～第十名 车号指定</strong>：</span><span>每一个车号为一投注组合，开奖结果“投注车号”对应所投名次视为中奖，其余情形视为不中奖。 <span lang="EN-U">
        </span> </span><span lang="EN-US">
       </span></li>
			</ul>
			<span>1～5龙虎 <a style="color: Red; border: 0;">【注意规则】</a> 为: </span>
			<ul>
				<li class="liB">冠 军 龙/虎：“第一名”车号大于“第十名”车号视为【龙】中奖、反之小于视为【虎】中奖，其余情形视为不中奖。</li>
				<li class="liB">亚 军 龙/虎：“第二名”车号大于“第九名”车号视为【龙】中奖、反之小于视为【虎】中奖，其余情形视为不中奖。</li>
				<li class="liB">第三名 龙/虎：“第三名”车号大于“第八名”车号视为【龙】中奖、反之小于视为【虎】中奖，其余情形视为不中奖。</li>
				<li class="liB">第四名 龙/虎：“第四名”车号大于“第七名”车号视为【龙】中奖、反之小于视为【虎】中奖，其余情形视为不中奖。</li>
				<li class="liB">第五名 龙/虎：“第五名”车号大于“第六名”车号视为【龙】中奖、反之小于视为【虎】中奖，其余情形视为不中奖。</li>
			</ul>
			<ul>
				<li><strong>“冠军车号＋亚军车号＝<b>冠亚</b>和值” </strong></li>
				<li><b><span>冠亚和单双</span></b><span>：<strong><b>“冠亚</b>和值</strong>”为单视为投注“单”的注单视为中奖，为双视为投注“双”的注单视为中奖，其余视为不中奖。 <span lang="EN-US">
        </span></span>
				</li>
				<li><b>冠亚和<span>大小</span></b><span>：</span><strong><b>“冠亚</b>和值</strong>”大于11时投注“大”的注单视为中奖，小于或等于11时投注“小”的注单视为中奖，其余视为不中奖。</li>
				<li><b>冠亚和</b><strong>指定</strong><span>：</span><span><strong><b>“冠亚</b>和值</strong>”可能出现的结果为3～19， <span lang="EN-US">
        </span></span> 投中对应<strong><b>“冠亚</b>和值</strong>”数字的视为中奖，其余视为不中奖。</li>
			</ul>
		</div>
		<div v-else-if="gameType.classId==3" class="typo">
		<ul>
			<li>具体游戏规则如下:</li>
		</ul>
		<ul>
			<li style="list-style-type: none;"><b>1 第一球~第五球</b></li>
			<li><b>第一球特~第五球特：</b>第一球特、第二球特、第三球特、第四球特、第五球特：指下注的每一球特与开出之号码其开奖顺序及开奖号码相同，视为中奖，如第一球开出号码8，下注第一球为8者视为中奖，其馀情形视为不中奖。</li>
			<li><b>单双大小：</b>根据相应单项投注第一球特 ~ 第五球特开出的球号，判断胜负。</li>
			<li><b>大小：</b>根据相应单项投注的第一球特 ~ 第五球特开出的球号大于或等于5为特码大，小于或等于4为特码小。</li>
			<li><b>单双：</b>根据相应单项投注的第一球特 ~
				第五球特开出的球号为双数叫特双，如2、6；特码为单数叫特单--如1、3</li>
			<li><b>总和单双大小：</b></li>
			<li><b>大小：</b>根据相应单项投注的第一球特 ~ 第五球特开出的球号大于或等于23为特码大，小于或等于22为特码小。</li>
			<li><b>单双：</b>根据相应单项投注的第一球特 ~
				第五球特开出的球号数字总和值是双数为总和双，数字总和值是单数为总和单。</li>
		</ul>
		<ul>
			<li style="list-style-type: none;"><b>2 前三特殊玩法： 豹子 &gt; 顺子
					&gt; 对子 &gt; 半顺 &gt; 杂六 。</b></li>
			<li><b>豹子：</b>中奖号码的万位千位百位数字都相同。----如中奖号码为000、111、999等，中奖号码的万位千位百位数字相同，
				则投注豹子者视为中奖，其它视为不中奖。</li>
			<li><b>顺子：</b>中奖号码的万位千位百位数字都相连，不分顺序。（数字9、0、1相连）--如中奖号码为123、901、321、546等，中奖号码万位千位百位数字相连，则投注顺子者视为中奖，其它视为不中奖。</li>
			<li><b>对子：</b>中奖号码的万位千位百位任意两位数字相同。（不包括豹子）----如中奖号码为001，112、696，中奖号码有两位数字相同，则投注对子者视为中奖，其它视为不中奖。如果开奖号码为豹子,则对子视为不中奖。如中奖号码为001，112、696，中奖号码有两位数字相同，则投注对子者视为中奖，其它视为不中奖。</li>
			<li><b>半顺：</b>中奖号码的万位千位百位任意两位数字相连，不分顺序。（不包括顺子、对子。）----如中奖号码为125、540、390、706，中奖号码有两位数字相连，则投注半顺者视为中奖，其它视为不中奖。如果开奖号码为顺子、对子,则半顺视为不中奖。--如中奖号码为123、901、556、233，视为不中奖。</li>
			<li><b>杂六：</b>不包括豹子、对子、顺子、半顺的所有中奖号码。----如中奖号码为157，中奖号码位数之间无关联性，则投注杂六者视为中奖，其它视为不中奖。</li>
		</ul>
		<ul>
			<li style="list-style-type: none;"><b>3 中三特殊玩法： 豹子 &gt; 顺子
					&gt; 对子 &gt; 半顺 &gt; 杂六 。</b></li>
			<li><b>豹子：</b>中奖号码的千位百位十位数字都相同。----如中奖号码为000、111、999等，中奖号码的千位百位十位数字相同，则投注豹子者视为中奖，其它视为不中奖。</li>
			<li><b>顺子：</b>中奖号码的千位百位十位数字都相连，不分顺序。（数字9、0、1相连）--如中奖号码为123、901、321、546等，中奖号码千位百位十位数字相连，则投注顺子者视为中奖，其它视为不中奖。</li>
			<li><b>对子：</b>中奖号码的千位百位十位任意两位数字相同。（不包括豹子）----如中奖号码为001，112、696，中奖号码有两位数字相同，则投注对子者视为中奖，其它视为不中奖如果开奖号码为豹子,则对子视为不中奖。如中奖号码为001，112、696，中奖号码有两位数字相同，则投注对子者视为中奖，其它视为不中奖。</li>
			<li><b>半顺：</b>中奖号码的千位百位十位任意两位数字相连，不分顺序。（不包括顺子、对子，数字9、0、1相连）----如中奖号码为125、540、390、706，中奖号码有两位数字相连，则投注半顺者视为中奖，其它视为不中奖。如果开奖号码为顺子、对子,
				则半顺视为不中奖。--如中奖号码为123、901、556、233，视为不中奖。</li>
			<li><b>杂六：</b>不包括豹子、对子、顺子、半顺的所有中奖号码。--如中奖千位百位十位号码为157，中奖号码位数之间无关联性，则投注杂六者视为中奖，其它视为不中奖。</li>
		</ul>
		<ul>
			<li style="list-style-type: none;"><b>4 后三特殊玩法： 豹子 &gt; 顺子
					&gt; 对子 &gt; 半顺 &gt; 杂六 。</b></li>
			<li><b>豹子：</b>
				中奖号码的百位十位个位数字都相同。----如中奖号码为000、111、999等，中奖号码的百位十位个位数字相同，则投注豹子者视为中奖，其它视为不中奖。</li>
			<li><b>顺子：</b>中奖号码的百位十位个位数字都相连，不分顺序。（数字9、0、1相连）----如中奖号码为123、901、321、546等，中奖号码百位十位个位数字相连，则投注顺子者视为中奖，其它视为不中奖。</li>
			<li><b>对子：</b>中奖号码的百位十位个位任意两位数字相同。(不包括豹子)----如中奖号码为001，112、696，中奖号码有两位数字相同，则投注对子者视为中奖，其它视为不中奖。如果开奖号码为豹子,则对子视为不中奖。如中奖号码为001，112、696，中奖
				号码有两位数字相同，则投注对子者视为中奖，其它视为不中奖。</li>
			<li><b>半顺：</b>中奖号码的百位十位个位任意两位数字相连，不分顺序。(不包括顺子、对子，数字9、0、1相连)----如中奖号码为125、540、390、706，中奖号码有两位数字相连，则投注半顺者视为中奖，其它视为不中奖。如果开奖号码为顺子、对子,则半顺
				视为不中奖。--如中奖号码为123、901、556、233，视为不中奖。</li>
			<li><b>杂六：</b>不包括豹子、对子、顺子、半顺的所有中奖号码。----如中奖百位十位个位号码为157，中奖号码位数之间无关联性，则投注杂六者视为中奖，其它视为不中奖。</li>
		</ul>
		<ul>
			<li style="list-style-type: none;"><b>5 龙虎和特殊玩法： 龙 &gt; 虎
					&gt; 和 （0爲最小，9爲最大）。</b></li>
			<li><b>龙：</b>开奖第一球（万位）的号码 大于 第五球（个位）的号码。如：第一球开出 6，第五球开出 2、第一球开出
				8，第五球开出 6、第一球开出 5，第五球开出 1...开奖为龙，投注龙者视为中奖，其它视为不中奖。开和视为不中奖</li>
			<li><b>虎：</b>开奖第一球（万位）的号码 小于 第五球（个位）的号码。如：第一球开出 2，第五球开出 6、第一球开出
				6，第五球开出 8、第一球开出 1，第五球开出 5...开奖为虎，投注虎者视为中奖，其它视为不中奖。开和视为不中奖</li>
			<li><b>和：</b>开奖第一球（万位）的号码 等于
				第五球（个位）的号码。如：2XXX2、6XXX6、8XXX8...开奖为和，投注和者视为中奖，其它视为不中奖。</li>
		</ul>
	</div>
	</div>
</template>

<script>
import { mapState } from "vuex";
export default {
  computed: {
    ...mapState("bet", ["gameType"])
  }
};
</script>

<style lang="less">
.lm-help {
  z-index: 2000;
  .yd-navbar {
    position: fixed !important;
    width: 100%;
    z-index: 1000;
    background: #011935 !important;
	color: #ffffff;
	.yd-navbar-item{
		padding: 0 !important;
	}
    .yd-navbar-center-title {
      color: #ffffff !important;
    }
    .yd-back-icon {
      padding: 0.2rem;
    }
    .yd-back-icon:before,
    .yd-next-icon:before {
      color: #ffffff;
    }
  }
  .typo {
    width: 100%;
    position: absolute;
    background: #ffffff;
    z-index: 1000;
    top: 1rem;
    bottom: 0;
    overflow: scroll;
    color: #3c3c3c;
    -webkit-overflow-scrolling: touch;
    padding: 0.1rem;
    font-size: 0.3rem;
  }
}
</style>